//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		Paddle.h
//!
//! @summary	パドルに関するヘッダファイル
//!
//! @date		2019.10.11
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ===================================================
#pragma once


// ヘッダファイルの読み込み =================================================
// <自作ヘッダファイル>
#include "GameObject.h"


// 構造体の定義 ============================================================
struct Tag_Paddle
{
	GameObject gameObject;
};
typedef struct Tag_Paddle Paddle;