//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		CPUPaddleController.h
//!
//! @summary	CPUによるパドル制御に関するヘッダファイル
//!
//! @date		2019.10.16
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ===================================================
#pragma once


// ヘッダファイルの読み込み =================================================
// <自作ヘッダファイル>
#include "../Objects/Paddle.h"
#include "../Objects/Ball.h"


// 定数の定義 ==============================================================
// CPUパドルの移動速度
#define CPU_PADDLE_MOVE_SPEED (5.0f)


// 関数の宣言 ==============================================================
//--------------------------------------------------------------------
//! @summary   CPUパドルの制御処理
//!
//! @parameter [paddle] 制御するパドル
//! @parameter [ball] 参照するボール情報
//!
//! @return    なし
//--------------------------------------------------------------------
void ControlCPUPaddle(Paddle* paddle, Ball* ball);
