//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		GameMain.h
//!
//! @summary	ゲーム関連のヘッダファイル
//!
//! @date		2019.10.11
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ===================================================
#pragma once



// 定数の定義 ==============================================================
// ゲームタイトル
#define GAME_TITLE     "PONG"

// ゲーム画面
#define SCREEN_WIDTH   640    // 幅[pixel]
#define SCREEN_HEIGHT  480    // 高さ[pixel]

#define SCREEN_CENTER_X (SCREEN_WIDTH  / 2)    // 画面の中央(X座標)
#define SCREEN_CENTER_Y (SCREEN_HEIGHT / 2)    // 画面の中央(Y座標)


// 関数の宣言 ==============================================================
//--------------------------------------------------------------------
//! @summary   ゲームの初期化処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void InitializeGame(void);



//--------------------------------------------------------------------
//! @summary   ゲームの更新処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void UpdateGame(void);



//--------------------------------------------------------------------
//! @summary   ゲームの描画処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void RenderGame(void);



//--------------------------------------------------------------------
//! @summary   ゲームの終了処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void FinalizeGame(void);
