//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		GameMain.cpp
//!
//! @summary	ゲーム関連のソースファイル
//!
//! @date		2019.10.11
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み =================================================
// <自作ヘッダファイル>
#include "GameMain.h"
#include "Scenes/SceneManager.h"


// グローバル変数の定義 =====================================================


// 関数の定義 ==============================================================
//--------------------------------------------------------------------
//! @summary   ゲームの初期化処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void InitializeGame(void)
{
	// 最初のシーンを設定
	SetStartScene(SCENE_PLAY);

	// シーンの初期化処理
	InitializeScene();
}



//--------------------------------------------------------------------
//! @summary   ゲームの更新処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void UpdateGame(void)
{
	// シーンの更新処理
	UpdateScene();
}



//--------------------------------------------------------------------
//! @summary   ゲームの描画処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void RenderGame(void)
{
	// シーンの描画処理
	RenderScene();
}



//--------------------------------------------------------------------
//! @summary   ゲームの終了処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void FinalizeGame(void)
{
	// シーンの終了処理
	FinalizeScene();
}
