//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		Sprite.cpp
//!
//! @summary	画像描画に関するソースファイル
//!
//! @date		2019.10.11
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み =================================================
// <自作ヘッダファイル>
#include "Sprite.h"


// 関数の定義 ==============================================================
//--------------------------------------------------------------------
//! @summary   画像の描画
//!
//! @parameter [sprite] 描画するスプライトデータ
//!
//! @return    なし
//--------------------------------------------------------------------
void DrawSprite(Sprite* sprite)
{
	DrawRectRotaGraphF(
		sprite->position.x, sprite->position.y,
		sprite->uv.x, sprite->uv.y,
		sprite->size.x, sprite->size.y,
		sprite->scale,
		sprite->angle, sprite->handle,
		sprite->transFlag,
		sprite->turnFlag);
}