//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		LogoScene.cpp
//!
//! @summary	ロゴシーンシーン関連のソースファイル
//!
//! @date		2019.10.11
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み =================================================
// <自作ヘッダファイル>
#include "LogoScene.h"
#include "SceneManager.h"


// 定数の定義 ==============================================================
// シーン変更までの時間
#define CHANGE_SCENE_TIME (3.0f)


// グローバル変数の定義 =====================================================
// 時間経過カウント
float g_timeCount;


// 関数の定義 ==============================================================
//--------------------------------------------------------------------
//! @summary   ロゴシーンの初期化処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void InitializeLogoScene(void)
{
	// カウントの初期化
	g_timeCount = 0.0f;
}



//--------------------------------------------------------------------
//! @summary   ロゴシーンの更新処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void UpdateLogoScene(void)
{
	// カウントの更新
	g_timeCount += GetFrameDeltaTime();

	// 3秒が経過する
	if (g_timeCount >= CHANGE_SCENE_TIME)
	{
		// タイトルシーンへ遷移する
		ChangeScene(SCENE_TITLE);
	}
}



//--------------------------------------------------------------------
//! @summary   ロゴシーンの描画処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void RenderLogoScene(void)
{
	DrawString(0, 0, "LOGO", COLOR_WHITE);
}



//--------------------------------------------------------------------
//! @summary   ロゴシーンの終了処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void FinalizeLogoScene(void)
{

}
