//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		LogoScene.h
//!
//! @summary	ロゴシーン関連のヘッダファイル
//!
//! @date		2019.10.11
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ===================================================
#pragma once


// 構造体の定義 ============================================================
struct Tag_LogoSceneObject
{
	// 時間経過カウント
	float timeCount;
};
typedef struct Tag_LogoSceneObject LogoSceneObject;


// 関数の宣言 ==============================================================
//--------------------------------------------------------------------
//! @summary   ロゴシーンの初期化処理
//!
//! @parameter [logoSceneObject] ロゴシーンで使用するオブジェクト
//!
//! @return    なし
//--------------------------------------------------------------------
void InitializeLogoScene(LogoSceneObject* logoSceneObject);



//--------------------------------------------------------------------
//! @summary   ロゴシーンの更新処理
//!
//! @parameter [logoSceneObject] ロゴシーンで使用するオブジェクト
//!
//! @return    なし
//--------------------------------------------------------------------
void UpdateLogoScene(LogoSceneObject* logoSceneObject);



//--------------------------------------------------------------------
//! @summary   ロゴシーンの描画処理
//!
//! @parameter [logoSceneObject] ロゴシーンで使用するオブジェクト
//!
//! @return    なし
//--------------------------------------------------------------------
void RenderLogoScene(LogoSceneObject* logoSceneObject);



//--------------------------------------------------------------------
//! @summary   ロゴシーンの終了処理
//!
//! @parameter [logoSceneObject] ロゴシーンで使用するオブジェクト
//!
//! @return    なし
//--------------------------------------------------------------------
void FinalizeLogoScene(LogoSceneObject* logoSceneObject);
