//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		PlayScene.cpp
//!
//! @summary	プレイシーン関連のソースファイル
//!
//! @date		2019.10.11
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み =================================================
// <自作ヘッダファイル>
#include "PlayScene.h"
#include "SceneManager.h"


// グローバル変数の定義 =====================================================


// 関数の定義 ==============================================================
//--------------------------------------------------------------------
//! @summary   プレイシーンの初期化処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void InitializePlayScene(void)
{
}



//--------------------------------------------------------------------
//! @summary   プレイシーンの更新処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void UpdatePlayScene(void)
{
	// スペースキーが入力される
	if (IsButtonPressed(PAD_INPUT_10))
	{
		// タイトルシーンへ遷移する
		ChangeScene(SCENE_TITLE);
	}
}



//--------------------------------------------------------------------
//! @summary   プレイシーンの描画処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void RenderPlayScene(void)
{
	Vector2 a;
	a = GetVector2One();
	DrawFormatString(0, 0, COLOR_WHITE, "x:%f, y:%f", a.x, a.y);
}



//--------------------------------------------------------------------
//! @summary   プレイシーンの終了処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void FinalizePlayScene(void)
{
}
