//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		SceneManager.h
//!
//! @summary	シーン管理に関するヘッダファイル
//!
//! @date		2019.10.11
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ===================================================
#pragma once



// 列挙型の宣言 ============================================================
//ゲームに必要なシーンのIDを登録
enum Tag_SceneID
{
	SCENE_PLAY,		// プレイ
	SCENE_LOGO,		// ロゴ
	SCENE_TITLE,	// タイトル
	SCENE_NONE,		// なし、登録されているシーンの数
};
typedef enum Tag_SceneID SceneID;


// 関数の宣言 ==============================================================
//--------------------------------------------------------------------
//! @summary   シーンの切り替え処理
//!
//! @parameter [nextSceneID] 次のシーンのID
//!
//! @return    なし
//--------------------------------------------------------------------
void ChangeScene(SceneID nextSceneId);



//--------------------------------------------------------------------
//! @summary   最初のシーンの設定
//!
//! @parameter [startSceneID] 最初のシーンのID
//!
//! @return    なし
//--------------------------------------------------------------------
void SetStartScene(SceneID startSceneID);



//--------------------------------------------------------------------
//! @summary   シーンの初期化処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void InitializeScene(void);



//--------------------------------------------------------------------
//! @summary   シーンの更新処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void UpdateScene(void);



//--------------------------------------------------------------------
//! @summary   シーンの描画処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void RenderScene(void);



//--------------------------------------------------------------------
//! @summary   シーンの終了処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void FinalizeScene(void);
