//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		TitleScene.h
//!
//! @summary	タイトルシーン関連のヘッダファイル
//!
//! @date		2019.10.11
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ===================================================
#pragma once


// 構造体の定義 ============================================================
struct Tag_TitleSceneObject
{

};
typedef struct Tag_TitleSceneObject TitleSceneObject;


// 関数の宣言 ==============================================================
//--------------------------------------------------------------------
//! @summary   タイトルシーンの初期化処理
//!
//! @parameter [titleSceneObject] タイトルシーンで使用するオブジェクト
//!
//! @return    なし
//--------------------------------------------------------------------
void InitializeTitleScene(TitleSceneObject* titleSceneObject);



//--------------------------------------------------------------------
//! @summary   タイトルシーンの更新処理
//!
//! @parameter [titleSceneObject] タイトルシーンで使用するオブジェクト
//!
//! @return    なし
//--------------------------------------------------------------------
void UpdateTitleScene(TitleSceneObject* titleSceneObject);



//--------------------------------------------------------------------
//! @summary   タイトルシーンの描画処理
//!
//! @parameter [titleSceneObject] タイトルシーンで使用するオブジェクト
//!
//! @return    なし
//--------------------------------------------------------------------
void RenderTitleScene(TitleSceneObject* titleSceneObject);



//--------------------------------------------------------------------
//! @summary   タイトルシーンの終了処理
//!
//! @parameter [titleSceneObject] タイトルシーンで使用するオブジェクト
//!
//! @return    なし
//--------------------------------------------------------------------
void FinalizeTitleScene(TitleSceneObject* titleSceneObject);
