//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		TitleScene.cpp
//!
//! @summary	タイトルシーンシーン関連のソースファイル
//!
//! @date		2019.10.11
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// ヘッダファイルの読み込み =================================================
// <自作ヘッダファイル>
#include "TitleScene.h"
#include "SceneManager.h"


// 定数の定義 ==============================================================
// シーン変更までの時間
#define CHANGE_SCENE_TIME (3.0f)


// グローバル変数の定義 =====================================================



// 関数の定義 ==============================================================
//--------------------------------------------------------------------
//! @summary   タイトルシーンの初期化処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void InitializeTitleScene(void)
{
}



//--------------------------------------------------------------------
//! @summary   タイトルシーンの更新処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void UpdateTitleScene(void)
{
	// スペースキーが入力される
	if (IsButtonPressed(PAD_INPUT_10))
	{
		// プレイシーンへ遷移する
		ChangeScene(SCENE_PLAY);
	}
}



//--------------------------------------------------------------------
//! @summary   タイトルシーンの描画処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void RenderTitleScene(void)
{
	DrawString(0, 0, "Title", COLOR_WHITE);
}



//--------------------------------------------------------------------
//! @summary   タイトルシーンの終了処理
//!
//! @parameter [void] なし
//!
//! @return    なし
//--------------------------------------------------------------------
void FinalizeTitleScene(void)
{

}
