//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		CollisionManager.h
//!
//! @summary	衝突判定に関するヘッダファイル
//!
//! @date		2019.10.11
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ===================================================
#pragma once


// 構造体の宣言 ============================================================




// 関数の宣言 ==============================================================
//--------------------------------------------------------------------
//! @summary   BoxCollider同士の衝突判定
//!
//! @parameter [collider1] 判定を行うBoxCollider1
//! @parameter [collider2] 判定を行うBoxCollider2
//!
//! @return    TRUE :当たっている
//! @return    FALSE:当たっていない
//--------------------------------------------------------------------
BOOL IsCollideAABB(const BoxCollider* collider1, const BoxCollider* collider2);